---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfile
source: html/8e30622c-4454-8088-30b0-3a32de8a7d5b.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfile

Defines parameters for C Profile structural section.

## Syntax (C#)
```csharp
public class StructuralSectionCProfile : StructuralSectionGeneralC
```